/*****************************************common begin*****************************************/
$(function(){
    wingplus.init({
        // appId: 'testLogin', //测试环境
        // appKey: 'abc', //测试环境
        // appId: 'f7f9a9d18da611e5a0be000d3a906774', //测试环境
        // appKey: 'CFHF7nQCCaojCX6Sm4eT1GEIWRprimgX', //测试环境
        appId: '0befcc31aab711e5a22602c85f0429f5', //生产环境
        appKey: 'GlKO1XOwNYhi8Kc3L2Kd1rOzhITc6VDX', //生产环境
        sdkType: 'html5',
        // platform: 'html5',
        debug: true,
        logSize: 10
    });

    $("#bind").click(function (){
        $("#bindModel").show(500);
    });

    if(isCG()){
        //CG平台不应该显示接口登录
        $("#api_login").hide();
        login();
    }

})
/*****************************************common end*****************************************/

/*****************************************login begin*****************************************/
function login(){
    wingplus.user.login({
        success: function(){
            console.log("登录成功");
            showResult('登录', '登录成功');
        },
        fail: function(){
            console.log("登录失败");
            showResult('登录', '登录失败');
        },
        cancel: function(){
            console.log("登录取消");
            showResult('登录', '登录取消');
        }
    });
}
/*****************************************login end*****************************************/

/*****************************************pay begin*****************************************/
$(function(){
    $("#wingplus_pay").load('./html/pay.html');
})
/*****************************************pay end*****************************************/

/*****************************************bind begin*****************************************/
$(function(){
    $("#wingplus_bind").load('./html/bind.html');
})
/*****************************************bind end*****************************************/


/*****************************************track begin*****************************************/
$(function(){
    $("#wingplus_track").load('./html/track.html');
})
/*****************************************track end*****************************************/

/*****************************************common begin*****************************************/
$(function(){
    $("#wingplus_common").load('./html/common.html');
})
/*****************************************common end*****************************************/

/*****************************************接口登录 begin*****************************************/
$(function(){
    $("#wingplus_login").load('./html/login.html');
})
/*****************************************接口登录 end*****************************************/

/*****************************************device begin*****************************************/
$(function(){
    $("#wingplus_device").load('./html/device.html');
})
/*****************************************device end*****************************************/
